In [1]:
# Q1
import pandas as pd
# let df is a dataframe seeries
df = pd.DataFrame(data= {
'Name': ['Ck', 'Ron', 'Mat','Josh', 'Tim', 'SypherPK', 'Dew', 'Vin'],
'Marks':[37, 91, 66, 42, 99, 81, 45, 71]
})
# 5 function with execution

In [2]:
df.head()

   Name  Marks
0    Ck     37
1   Ron     91
2   Mat     66
3  Josh     42
4   Tim     99

In [3]:
df.tail()

       Name  Marks
3      Josh     42
4       Tim     99
5  SypherPK     81
6       Dew     45
7       Vin     71

In [4]:
df.value_counts()

Name      Marks
Ck        37       1
Dew       45       1
Josh      42       1
Mat       66       1
Ron       91       1
SypherPK  81       1
Tim       99       1
Vin       71       1
dtype: int64

In [5]:
df.loc[0:3, ['Name']]

   Name
0    Ck
1   Ron
2   Mat
3  Josh

In [6]:
df.iloc[0:3]

  Name  Marks
0   Ck     37
1  Ron     91
2  Mat     66

In [7]:
df.describe()

           Marks
count   8.000000
mean   66.500000
std    23.360528
min    37.000000
25%    44.250000
50%    68.500000
75%    83.500000
max    99.000000

In [8]:
# Q2
import pandas as pd
df1 = pd.DataFrame(data={"A":['ak','sk','dk','er','qw','ad','df','jk','lp','hg'],
                        "B":[10,12,11,15,18,19,16,17,18,23],
                        "C":[5,7,6,11,12,14,11,12,12,15]
                        })
df2 =df1[1:11:2]

In [9]:
df2

    A   B   C
1  sk  12   7
3  er  15  11
5  ad  19  14
7  jk  17  12
9  hg  23  15

In [10]:
df3 = pd.DataFrame(df1, index=[1,3,5,7,9])

In [11]:
df3

    A   B   C
1  sk  12   7
3  er  15  11
5  ad  19  14
7  jk  17  12
9  hg  23  15

In [12]:
# Q3
import pandas as pd

data = {'values' : [10, 20, 30, 40, 50]}

df = pd.DataFrame(data)
print(df)
print("sum of first 3",df[0:3].sum())

   values
0      10
1      20
2      30
3      40
4      50
sum of first 3 values    60
dtype: int64

In [13]:
# Q4
import pandas as pd
data1 = {'text': ['Aman kumar','Music by sonu', 'Poetry of ravi', 'Music present by ak', 'Comedy with raju']}
df4= pd.DataFrame(data1)
df4['word_count'] = df4['text'].str.split().str.len()
print(df4)

                  text  word_count
0           Aman kumar           2
1        Music by sonu           3
2       Poetry of ravi           3
3  Music present by ak           4
4     Comedy with raju           3

In [14]:
# Q5
'''dataframe.size
   Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

   dataframe.shape
   Return : Returns tuple of shape (Rows, columns) of dataframe/series
'''

'dataframe.size\n   Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.\n\n   dataframe.shape\n   Return : Returns tuple of shape (Rows, columns) of dataframe/series\n'

In [15]:
# Q6
# pandas function use to read an excel file
'''read_excel() function
   We can use the pandas module read_excel() function to read the excel file data into a DataFrame object. 
   If you look at an excel sheet, it's a two-dimensional table. The DataFrame object also represents a two-dimensional tabular data structure.
   '''

"read_excel() function\n   We can use the pandas module read_excel() function to read the excel file data into a DataFrame object. \n   If you look at an excel sheet, it's a two-dimensional table. The DataFrame object also represents a two-dimensional tabular data structure.\n   "

In [16]:
# Q7
'''code to extract username for email '''


import pandas as pd
df5 = pd.DataFrame({'email':['abc@gmail.com','john.doe@example.com','ak@gmail.com','kkk@gmail.com','aa@yahoo.com']})

df5['username'] = df5['email'].str.split('@').str[0]
print (df5)


# df['email'].str.split(@).str[0] for before @ and replace 0 to 1 for after @ 
# i mean if abc@gmail.com as example for extraction abc put df5['username'] as it above 
# And for extraction of gmail.com put 1 (on place of 0(zero)) in df5['username']

                  email  username
0         abc@gmail.com       abc
1  john.doe@example.com  john.doe
2          ak@gmail.com        ak
3         kkk@gmail.com       kkk
4          aa@yahoo.com        aa

In [23]:
# Q8
'''code that contain A>5and B<10'''

import pandas as pd

df6= pd.DataFrame({'A':[2,5,6,4,8,7,4,6,5,6,4,5,1,5,3,4,8,6,7,4],
                   'B':[12,3,15,6,14,6,8,5,4,8,4,13,12,15,7,14,8,9,9,7],
                   'C':[16,5,4,8,9,4,9,8,6,13,2,16,5,4,9,8,4,9,6,4]
                  })
dff=df6[(df6['A']>5) & (df6['B']<10)]

print(dff)

    A  B   C
5   7  6   4
7   6  5   8
9   6  8  13
16  8  8   4
17  6  9   9
18  7  9   6

In [2]:
# Q9
 # to find mean , median and std
    
import pandas as pd

data2 = {'values' : [10, 20, 30, 40, 50]}

df7 = pd.DataFrame(data2)
print(df7)
print("mean",df7[0:5].mean())
print("median",df7[0:5].median())
print("standard deviation",df7[0:5].std())

   values
0      10
1      20
2      30
3      40
4      50
mean values    30.0
dtype: float64
median values    30.0
dtype: float64
standard deviation values    15.811388
dtype: float64

In [19]:
# Q10
import pandas as pd 
df8 = pd.DataFrame({'Value': [6.11,6.08,6.11,6.15,6.25,6.24,6.26,6.23,6.28,6.31],
                    'Date':['1989-01-02','1989-01-03','1989-01-04','1989-01-05','1989-01-09','1989-01-10','1989-01-11','1989-01-12','1989-01-13','1989-01-16']
                   })
df8['MA'] = df8.rolling(window=7).mean()

print(df8)

   Value        Date        MA
0   6.11  1989-01-02       NaN
1   6.08  1989-01-03       NaN
2   6.11  1989-01-04       NaN
3   6.15  1989-01-05       NaN
4   6.25  1989-01-09       NaN
5   6.24  1989-01-10       NaN
6   6.26  1989-01-11  6.171429
7   6.23  1989-01-12  6.188571
8   6.28  1989-01-13  6.217143
9   6.31  1989-01-16  6.245714

/tmp/ipykernel_7313/1843260377.py:6: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df8['MA'] = df8.rolling(window=7).mean()

In [20]:
# Q11
# find day of date


import pandas as pd
df9 = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df9['Date'] = pd.to_datetime(df9['Date'])

df9['day_of_week'] = df9['Date'].dt.day_name()
print(df9)

        Date day_of_week
0 2023-01-01      Sunday
1 2023-01-02      Monday
2 2023-01-03     Tuesday
3 2023-01-04   Wednesday
4 2023-01-05    Thursday

In [2]:
# Q12

import pandas as pd
import numpy as np

dfe = pd.DataFrame(np.random.random(50))

dfe['date'] = pd.date_range('2023-1-1', periods=50)

limit = (dfe['date'] > '2023-1-1') & (dfe['date'] <= '2023-1-31')

print(dfe.loc[limit])

           0       date
1   0.861292 2023-01-02
2   0.238260 2023-01-03
3   0.144292 2023-01-04
4   0.567182 2023-01-05
5   0.651687 2023-01-06
6   0.699306 2023-01-07
7   0.997579 2023-01-08
8   0.062917 2023-01-09
9   0.972338 2023-01-10
10  0.833181 2023-01-11
11  0.805693 2023-01-12
12  0.511396 2023-01-13
13  0.915093 2023-01-14
14  0.876799 2023-01-15
15  0.050925 2023-01-16
16  0.049935 2023-01-17
17  0.048226 2023-01-18
18  0.158115 2023-01-19
19  0.285134 2023-01-20
20  0.794010 2023-01-21
21  0.403104 2023-01-22
22  0.211660 2023-01-23
23  0.709622 2023-01-24
24  0.955432 2023-01-25
25  0.625240 2023-01-26
26  0.162665 2023-01-27
27  0.093430 2023-01-28
28  0.056473 2023-01-29
29  0.692466 2023-01-30
30  0.966996 2023-01-31

In [11]:
dfe['timestamp'] = pd.to_datetime(dfe['date'])

In [12]:
dfe

           0       date  timestamp
0   0.920026 2023-01-01 2023-01-01
1   0.861292 2023-01-02 2023-01-02
2   0.238260 2023-01-03 2023-01-03
3   0.144292 2023-01-04 2023-01-04
4   0.567182 2023-01-05 2023-01-05
5   0.651687 2023-01-06 2023-01-06
6   0.699306 2023-01-07 2023-01-07
7   0.997579 2023-01-08 2023-01-08
8   0.062917 2023-01-09 2023-01-09
9   0.972338 2023-01-10 2023-01-10
10  0.833181 2023-01-11 2023-01-11
11  0.805693 2023-01-12 2023-01-12
12  0.511396 2023-01-13 2023-01-13
13  0.915093 2023-01-14 2023-01-14
14  0.876799 2023-01-15 2023-01-15
15  0.050925 2023-01-16 2023-01-16
16  0.049935 2023-01-17 2023-01-17
17  0.048226 2023-01-18 2023-01-18
18  0.158115 2023-01-19 2023-01-19
19  0.285134 2023-01-20 2023-01-20
20  0.794010 2023-01-21 2023-01-21
21  0.403104 2023-01-22 2023-01-22
22  0.211660 2023-01-23 2023-01-23
23  0.709622 2023-01-24 2023-01-24
24  0.955432 2023-01-25 2023-01-25
25  0.625240 2023-01-26 2023-01-26
26  0.162665 2023-01-27 2023-01-27
27  0.093430 2023-01-28 2023-01-28
28  0.056473 2023-01-29 2023-01-29
29  0.692466 2023-01-30 2023-01-30
30  0.966996 2023-01-31 2023-01-31
31  0.220236 2023-02-01 2023-02-01
32  0.444269 2023-02-02 2023-02-02
33  0.235340 2023-02-03 2023-02-03
34  0.032064 2023-02-04 2023-02-04
35  0.643653 2023-02-05 2023-02-05
36  0.182653 2023-02-06 2023-02-06
37  0.494894 2023-02-07 2023-02-07
38  0.611726 2023-02-08 2023-02-08
39  0.028906 2023-02-09 2023-02-09
40  0.809326 2023-02-10 2023-02-10
41  0.811681 2023-02-11 2023-02-11
42  0.492697 2023-02-12 2023-02-12
43  0.081995 2023-02-13 2023-02-13
44  0.952538 2023-02-14 2023-02-14
45  0.192648 2023-02-15 2023-02-15
46  0.859416 2023-02-16 2023-02-16
47  0.288523 2023-02-17 2023-02-17
48  0.447796 2023-02-18 2023-02-18
49  0.548474 2023-02-19 2023-02-19

In [22]:
# Q13
'''To use the basic functions of pandas,
   need to import pandas'''

#Two most basic functions after reading data is to know the number of rows and columns, 
#and to know the datatype of variables

'To use the basic functions of pandas,\n   need to import pandas'